In [1]:
import pandas as pd

https://leetcode.com/studyplan/30-days-of-pandas/

# leetcode: pandas: 1

In [332]:
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})
world

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [335]:
# name, population, and area of the big countries.
world.drop(columns=['gdp', 'continent'], inplace=False)
world[(world['area'] >= 3000000) | (world['population'] >= 25000000)].drop(columns=['continent', 'gdp'])

          name     area  population
0  Afghanistan   652230    25500100
2      Algeria  2381741    37100000

# leetcode: pandas: 2

In [4]:
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})
products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [5]:
products[(products['low_fats'] == "Y") & (products['recyclable'] == "Y")].drop(columns=['low_fats', "recyclable"])

   product_id
1           1
3           3

# leetcode: pandas: 3

In [6]:
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

In [7]:
# надо вернуть id клиентов которые ни разу не делали покупки

In [8]:
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [9]:
orders

   id  customerId
0   1           3
1   2           1

In [10]:
result = customers[customers['id'].isin(orders['customerId']) == False]
result = result.drop(columns=['id'])
result = result.rename(columns={'name': 'Customers'})
result

  Customers
1     Henry
3       Max

In [11]:
customers[~customers['id'].isin(orders['customerId'])].drop(columns='id').rename(columns={'name':'Customers'})

  Customers
1     Henry
3       Max

# leetcode: pandas: 4

In [12]:
# найти id всех авторов, которые просмотрели свою статью хотябы раз, отсортировать результат в возрастающем порядке

In [13]:
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

In [14]:
views

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
1           1          3          6 2019-08-02
2           2          7          7 2019-08-01
3           2          7          6 2019-08-02
4           4          7          1 2019-07-22
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [15]:
result = views.drop(columns=['article_id', 'view_date']).drop_duplicates()
result

   author_id  viewer_id
0          3          5
1          3          6
2          7          7
3          7          6
4          7          1
5          4          4

In [16]:
result = result[result['author_id'] == result['viewer_id']].rename(
    columns={'author_id': 'id'}).drop(columns=['viewer_id']).sort_values(by='id')
result

   id
5   4
2   7

In [17]:
views

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
1           1          3          6 2019-08-02
2           2          7          7 2019-08-01
3           2          7          6 2019-08-02
4           4          7          1 2019-07-22
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [18]:
result = views[views['author_id'] == views['viewer_id']]
result

   article_id  author_id  viewer_id  view_date
2           2          7          7 2019-08-01
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [19]:
result = pd.DataFrame(
    {'id': result['author_id'].sort_values().unique()}
    )
result

   id
0   4
1   7

# leetcode: pandas: 5

In [20]:
# найти id всех невалидных твитов. Твит невалидный, если число символов в твите строго больше 15

In [21]:
data = [[1, 'Vote for Biden'], [2, 'Let us make America great again!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

In [22]:
tweets['content'].str.len()

0    14
1    32
Name: content, dtype: int64

In [23]:
tweets[tweets['content'].str.len() > 15].drop(columns=['content'])

   tweet_id
1         2

# leetcode: pandas: 6

In [353]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})
employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [25]:
# Расчитать премию каждого сотрудника. 
# Премия сотрудника составляет 100 % от его оклада, если идентификатор сотрудника - нечетное число 
# и имя сотрудника не начинается с символа "M". В противном случае премия сотрудника равна 0.

In [26]:
employees['name'].str[0]

0    M
1    M
2    A
3    J
4    K
Name: name, dtype: object

In [27]:
employees['bonus'] = 0
employees

   employee_id     name  salary  bonus
0            2     Meir    3000      0
1            3  Michael    3800      0
2            7  Addilyn    7400      0
3            8     Juan    6100      0
4            9   Kannon    7700      0

In [28]:
result = employees[(employees['employee_id']%2 != 0) & (employees['name'].str[0] != 'M')]
result

   employee_id     name  salary  bonus
2            7  Addilyn    7400      0
4            9   Kannon    7700      0

In [29]:
employees.loc[employees['employee_id'].isin(result['employee_id']), 'bonus'] = employees['salary']
employees.drop(columns=['name', 'salary']).sort_values('employee_id')

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

# leetcode: pandas: 7

In [356]:
data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})
users

   user_id   name
0        1  aLice
1        2    bOB

In [31]:
# исправить имена в таблице так, чтобы только 1 символ имени был заглавным

In [32]:
users['name'].str[0]

0    a
1    b
Name: name, dtype: object

In [33]:
users['name'] = users['name'].str.lower()
users['name'] = users['name'].str[0].str.upper() + users['name'].str[1:]
users.sort_values('user_id')

   user_id   name
0        1  Alice
1        2    Bob

In [34]:
data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})

In [35]:
users['name'] = users['name'].str.capitalize()
users

   user_id   name
0        1  Alice
1        2    Bob

# leetcode: pandas: 8

In [36]:
data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})

In [37]:
# произвести валидацию пользовательских электронных почт. Электронная почта состоит из префикса и домена
# префикс может содержать строчные или заглавные буквы, цифры, знаки: '.', '-', '_', должен начинаться с буквы 
# домен @leetcode.com

In [38]:
data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})
users

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
1        2   Jonathan          jonathanisgreat
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com
4        5     Marwan  quarz#2020@leetcode.com
5        6      David        david69@gmail.com
6        7    Shapiro      .shapo@leetcode.com

In [39]:
result = users.loc[(users['mail'].str.contains(r'^[a-zA-Z][\w.-]*@leetcode\.com$', regex=True) == True)]
result

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

# leetcode: pandas: 9

In [59]:
data = [[1, 'Daniel', 'YFEV COUGH'], [2, 'Alice', ''], [3, 'Bob', 'DIAB100 MYOP'], [4, 'George', 'ACNE DIAB100'], [5, 'Alain', 'DIAB201']]
patients = pd.DataFrame(data, columns=['patient_id', 'patient_name', 'conditions']).astype({'patient_id':'int64', 'patient_name':'object', 'conditions':'object'})
patients

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
1           2        Alice
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

In [ ]:
# вывести диабетиков, информация об этом обозначается как DIAB1

In [65]:
patients.loc[patients['conditions'].str.contains(r'\bDIAB1\w*')]

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

# leetcode: pandas: 10

In [221]:
data = [[1, 100], [2, 100], [3, 100], [4, 300]]
employee = pd.DataFrame(data, columns=['Id', 'Salary']).astype({'Id':'Int64', 'Salary':'Int64'})
employee

   Id  Salary
0   1     100
1   2     100
2   3     100
3   4     300

In [ ]:
# найти нaибольший n-й salary

In [211]:
N = 2

In [222]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    if (len(employee['Salary'].drop_duplicates()) >= N) & (N > 0):
        result = employee['Salary'].sort_values(ascending=False).reset_index().drop(columns=['index']).drop_duplicates().iloc[N-1].values
        result = pd.DataFrame(data=[result], columns=[f'getNthHighestSalary({N})'])
        return result
    else:
        return pd.DataFrame(data=[None], columns=[f'getNthHighestSalary({N})'])

In [223]:
nth_highest_salary(employee=employee, N=2)

   getNthHighestSalary(2)
0                     100

# leetcode: pandas: 11

In [264]:
data = [[1, 100], [2, 100], [3, 200]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})
employee

   id  salary
0   1     100
1   2     100
2   3     200

In [265]:
employee['salary'].sort_values(ascending=False).reset_index().drop(columns=['index']).drop_duplicates()

   salary
0     200
1     100

In [266]:
if len(employee['salary'].drop_duplicates()) >= 2:
    result = employee['salary'].sort_values(ascending=False).reset_index().drop(columns=['index']).drop_duplicates().iloc[1].values
    result = pd.DataFrame(data=result, columns=['SecondHighestSalary'])
    print(result)
else:
    result = pd.DataFrame(data=[None], columns=['SecondHighestSalary'])

   SecondHighestSalary
0                  100

# leetcode: pandas: 12

In [413]:
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [414]:
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [415]:
department

   id   name
0   1     IT
1   2  Sales

In [ ]:
# найти самую большую зарплату в каждом из отделов

In [313]:
employee['max_salary_in_dept'] = employee.groupby('departmentId')['salary'].transform('max')
employee

   id   name  salary  departmentId  max_salary_in_dept
0   1    Joe   70000             1               90000
1   2    Jim   90000             1               90000
2   3  Henry   80000             2               80000
3   4    Sam   60000             2               80000
4   5    Max   90000             1               90000

In [314]:
department_dict = department.set_index('id')['name'].to_dict()

In [315]:
employee['Department'] = employee['departmentId'].map(department_dict)
employee

   id   name  salary  departmentId  max_salary_in_dept Department
0   1    Joe   70000             1               90000         IT
1   2    Jim   90000             1               90000         IT
2   3  Henry   80000             2               80000      Sales
3   4    Sam   60000             2               80000      Sales
4   5    Max   90000             1               90000         IT

In [327]:
result = employee[employee['salary'] == employee['max_salary_in_dept']].drop(columns=['id', 'departmentId', 'max_salary_in_dept'])
result.rename(columns={"name": 'Employee', 'salary': 'Salary'})

  Employee  Salary Department
1      Jim   90000         IT
2    Henry   80000      Sales
4      Max   90000         IT